In [2]:
import pandas as pd

#creating a dataframe

india_weather = pd.DataFrame({
    'city':['mumbai', 'delhi', 'banglore'],
    'temperature':[32,45,30],
    'humidity':[80,60,78]
    
})
india_weather

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [4]:
#creating a second dataframe


us_weather = pd.DataFrame({
    'city':['newyork', 'chicago', 'orlando'],          
    'temperature':[21,14,35],
    'humidity':[68,65,75]
    
})
us_weather

      city  temperature  humidity
0  newyork           21        68
1  chicago           14        65
2  orlando           35        75

## now we will join these dataframes together...lets see how

In [5]:
df = pd.concat ([india_weather, us_weather])    #use of concat to join the two dataframes
df

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
0   newyork           21        68
1   chicago           14        65
2   orlando           35        75

In [7]:
df = pd.concat([india_weather, us_weather], ignore_index = True)  #ignore_index = true is used to have a sequential index number
df

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
3   newyork           21        68
4   chicago           14        65
5   orlando           35        75

In [10]:
df = pd.concat([india_weather, us_weather],keys = ['india','us'])    #incase we want to specify a little clear which country
df                                                                  #has what data in the same joined format

             city  temperature  humidity
india 0    mumbai           32        80
      1     delhi           45        60
      2  banglore           30        78
us    0   newyork           21        68
      1   chicago           14        65
      2   orlando           35        75

In [11]:
df.loc['us']                   #use of 'loc' to get the exact dataframe we want from the mergerd dataframe(calling the index)

      city  temperature  humidity
0  newyork           21        68
1  chicago           14        65
2  orlando           35        75

In [13]:
df.loc['india']                #use of 'loc' to get the exact dataframe we want from the mergerd dataframe(calling the index)

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [16]:
temperature_df = pd.DataFrame({
    'city':['mumbai', 'delhi', 'banglore'],    #to create only temperature dataframe of the india(its cities)
    'temperature':[32,45,30],
    
})
temperature_df

       city  temperature
0    mumbai           32
1     delhi           45
2  banglore           30

In [23]:
windspeed_df = pd.DataFrame({
    'city':['mumbai', 'delhi', 'banglore'],
    'windspeed':[7,12,19]
    
})
windspeed_df

       city  windspeed
0    mumbai          7
1     delhi         12
2  banglore         19

## we want windspeed as a column in the original dataframe, lets do it

In [21]:
df = pd.concat([temperature_df,windspeed_df], sort=True)
df

       city  temperature  windspeed
0    mumbai         32.0        NaN
1     delhi         45.0        NaN
2  banglore         30.0        NaN
0    mumbai          NaN        7.0
1     delhi          NaN       12.0
2  banglore          NaN       19.0

## here we can see that it created additional rows of cities,coz axis = 0 is bydefault, it adds the two dataframes by rows, we want it via columns so we have to make axis = 1.

In [24]:
df = pd.concat([temperature_df,windspeed_df], sort=True, axis =1)
df

       city  temperature      city  windspeed
0    mumbai           32    mumbai          7
1     delhi           45     delhi         12
2  banglore           30  banglore         19

## if we want to change the index we can do it while creating the dataframe, by writing index=[0,1,2] so that it will change  the corresponding values alligned with it.

## we can also join a dataframe with a series

In [25]:
temperature_df

       city  temperature
0    mumbai           32
1     delhi           45
2  banglore           30

In [29]:
s = pd.Series(['humid', 'dry', 'rain'],name='event')   #creatd a series wihich we will assign to the temperature_df later
s

0    humid
1      dry
2     rain
Name: event, dtype: object

In [31]:
df = pd.concat([temperature_df,s], axis=1)   #now we joined the dataframe with a series using concat and axis=1 coz we want it
df                                             #to be added as a column

       city  temperature  event
0    mumbai           32  humid
1     delhi           45    dry
2  banglore           30   rain